/*
exercise4)
회문(문장의 배열이 대칭을 이루는 문자열)을 구별할 수 있는 프로그램을 작성하라.
작성하기 위해서는 문자열을 낱자로 스플릿하여 앞자리와 뒷자리를 대응하는 프로그램을 만들어보자.
0:기 1:러 2:기 
맨 앞번호 0 과 맨 뒷번호2가 각각 기로 대응하고 남는 1번은 대응하는 숫자가 없기에 회문이라고 알 수 있다.

1. 문자열을 입력 받는다.(stack)
2. 입력 받은 문자열을 역순으로 배열한다.(stack)
3. 입력받은 문자열과 역순의 문자열을 for문을 사용하여 0번부터 끝번호까지 대응시킨다.
4. 대응하는 과정에서 같으면 flag를 1 그렇지 않으면 0으로 출력하게한다.
5. 0이 나오면 바로 quit하고 회문이 아님을 출력한다.
6. 0이 출력되지 않으면 회문이라고 출력한다. 

======================
extra_exam) 숫자회문을 추출하라. 
숫자회문을 추출하기 위해서 내가 원하는 숫자를 입력하고 입력받은 숫자 내 탐색을 실시하여 회문에 해당하는 숫자를 추출하여보자.
*/


#include <stdio.h>
#include <string.h>
#include <stdbool.h>


void main(){

}
